In [ ]:
# 1. Write a Pandas program to print a concise summary of the dataset. Hint: Info

# 2. Write a Pandas program to extract the column labels, shape and data types of the dataset

# 3. Write a Pandas program to create a Pivot table with the following indexes from the data set of titanic.csv

#   a. Sex - age

#   b. Sex - class

#   c. Sex - Passenger – class

#   d. Sex – survived

# 4. Write a Pandas program to partition each of the passengers into four categories based on their age

# 5. Write a Pandas program to create a Pivot table and find number of adult male, adult female and children

In [20]:
import pandas as pd;
import numpy as np;

titanic = pd.read_csv("titanic.csv", sep=",")

In [3]:
# 1. Write a Pandas program to print a concise summary of the dataset. Hint: Info

titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [12]:
# 2. Write a Pandas program to extract the column labels, shape and data types of the dataset

print(titanic.columns.values)
print("---------")
print(titanic.shape)
print("---------")
print(titanic.dtypes)
print("---------")

['Survived' 'Pclass' 'Name' 'Sex' 'Age' 'Siblings/Spouses Aboard'
 'Parents/Children Aboard' 'Fare']
---------
(887, 8)
---------
Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object
---------

In [13]:
titanic.head(5)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [24]:
# 3. Write a Pandas program to create a Pivot table with the following indexes from the data set of titanic.csv
#   a. Sex - age
#   b. Sex - class
#   c. Sex - Passenger – class
#   d. Sex – survived
sex_age_pivot = pd.pivot_table(titanic,index=["Sex", "Age"])
sex_passenger_pivot = pd.pivot_table(titanic,index=["Sex", "Pclass"])
sex_survived_pivot = pd.pivot_table(titanic,index=["Sex", "Survived"])

                  Fare  Parents/Children Aboard    Pclass  \
Sex    Age
female 0.75  19.258300                 1.000000  3.000000
       1.00  13.437500                 1.500000  3.000000
       2.00  40.261900                 1.428571  2.571429
       3.00  29.373633                 1.333333  2.666667
       4.00  22.828340                 1.200000  2.600000

             Siblings/Spouses Aboard  Survived
Sex    Age
female 0.75                 2.000000  1.000000
       1.00                 0.500000  1.000000
       2.00                 1.428571  0.428571
       3.00                 2.333333  0.333333
       4.00                 0.800000  1.000000

In [23]:
# 4. Write a Pandas program to partition each of the passengers into four categories based on their age

bins = [0, 11, 18, 45, np.inf]
ranges = ['<10', '11-18', '18-45', '45+']

titanic['AgeRange'] = pd.cut(titanic['Age'], bins, labels=ranges)
titanic.head(5)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,AgeRange
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500,18-45
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833,18-45
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250,18-45
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000,18-45
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500,18-45

In [42]:
# 5. Write a Pandas program to create a Pivot table and find number of adult male, adult female and children

bins = [0, 18, np.inf]
ranges = ['<18', '18+']

titanic['Adult/Children'] = pd.cut(titanic['Age'], bins, labels=ranges)

# Option 1
pd.pivot_table(titanic,index=["Adult/Children", "Sex"], aggfunc='count')["Age"]

Adult/Children  Sex
<18             female     80
                male       86
18+             female    234
                male      487
Name: Age, dtype: int64